ZiadAbdelati/waveshare-boost-gauge/sdkconfig.defaults
# Waveshare ESP32-S3-Touch-AMOLED-1.75 — boost gauge
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# PSRAM / cache (8 MB octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Keep Wi-Fi/LWIP allocations out of the internal DMA heap used by the QSPI display.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# LCD SPI: shallow queue — draw buffers are DMA-capable so no bounce allocs.
CONFIG_BSP_LCD_TRANS_QUEUE_DEPTH=4

# Three WebSocket dashboards plus HTTP fallback do not need throughput-oriented Wi-Fi pools.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=8
# Wi-Fi IRAM speed opts are off: they park Wi-Fi hot code in DIRAM, and that is
# exactly the internal DRAM the BT controller (BLE central) needs a contiguous
# block of at runtime. The WebSocket pool (62.5 Hz x 3) and 4 Hz HTTP poll are
# nowhere near the throughput these opts buy; see the 2026-07-26 coexistence
# spike. LWIP stays in PSRAM via SPIRAM_TRY_ALLOCATE_WIFI_LWIP above.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# NimBLE host + controller (BLE central for the OBD2/TPMS transport). The
# controller runs from flash to keep internal DRAM headroom; BLE+Wi-Fi
# coexistence was proven in the 2026-07-26 spike once LVGL IRAM moved out of
# the way (LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n, now the default). The compile-time
# BOOST_TPMS_BLE_ENABLED gate and the persisted tpmsBle runtime toggle control
# whether the link is actually used. See docs/research/2026-07-26-ble-wifi-coexistence.md.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY=y
CONFIG_BT_CTRL_BLE_MASTER=y
# Dual-role NimBLE: the OBD2 central's scan->connect handoff briefly holds two
# controller "activity instances" (scan + connection), and the companion-app
# peripheral adds advertising + a phone connection, so up to four instances can
# be simultaneous (central handoff + peripheral adv + phone). 5 keeps ~828 B of
# headroom per extra instance over the old 3 (which fixed the connect-time
# "Memory Capacity Exceeded", HCI 0x07, that a value of 1 caused).
CONFIG_BT_CTRL_BLE_MAX_ACT=5
# Internal DRAM is shared with Wi-Fi, the QSPI display double-buffer and the
# region-dbuf scratch strips. Park the NimBLE host mempools (msys/ACL) in PSRAM
# so the BT controller's own internal block is the only new internal demand.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# The companion-app GATT contract requires the LE-SC pairing bond to survive
# reboots ("pair once, then silent reconnect in the car"). NimBLE only writes
# bonds through its NVS-backed config store when this is on.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# Companion GATT request routing parses JSON and serializes responses from the
# NimBLE host callback. ESP-IDF's 4096-byte default overflows on the first
# encrypted Control request; keep enough stack for the full 480-byte envelope.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# The LVGL worker and HTTP server do not perform flash writes; keep their stacks in PSRAM.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y

CONFIG_FREERTOS_HZ=1000

# app_main builds the persisted LVGL scene before it returns. The Neon scene's
# sprite bake exceeds ESP-IDF's 3584-byte default and otherwise boot-loops before
# brightness and networking start.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# LVGL 9
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
# LVGL rasterises every pixel in two "swdraw" threads created at
# tskIDLE_PRIORITY + LV_DRAW_THREAD_PRIO (default 3), below the sample task and
# httpd. Raising it to the Kconfig maximum of 4 was tried and measured on
# hardware: frames-over-budget per second did not improve (3 -> 4, i.e. noise).
# Left at the default. The judder is renders occasionally exceeding the 16 ms
# refresh period, not scheduler starvation - see AGENTS.md.
#
# LV_ATTRIBUTE_FAST_MEM_USE_IRAM parks LVGL's hot rendering functions in IRAM at
# a cost of 82,812 bytes of DIRAM (idf.py size DIRAM remaining 67,869 -> 150,681,
# measured pre-rebase; the option's isolated cost is unchanged post-rebase).
# It was set in the very first commit with no rationale and went unpriced for the
# project's whole history. Measured on hardware 2026-07-26, all four faces, demo
# mode, 3 WebSocket clients, three 30 s runs per face per build, each from a
# fresh boot: renderFps and pixelsPerSecond flat on every face. Re-verified
# 2026-07-27 on today's main (post PSRAM-log-ring-move): a clean-network re-run
# (n=6/build, interleaved) found a real, non-overlapping ~3.7 ms/7% worstRenderUs
# cost on big-digit specifically - reported, not a blocker, since it does not
# touch the dyno-cell/arc cadence guard. Turning it off releases 82,948 bytes of
# internal free at peak on today's main (minimum-ever-free 52,659 -> 135,607) and
# takes the largest free block from 43,008 to 63,488. GIF playback - the path
# most sensitive to internal-RAM pressure - was verified clean on both builds
# 2026-07-27, with substantially more headroom with this option off. Do not turn
# this back on without before/after evidence - see
# docs/research/2026-07-26-lvgl-iram-benefit.md.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=n
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
# GIF playback reads a variable image descriptor mapped from the raw media partition.
CONFIG_LV_USE_GIF=y
# QR overlay for the two-finger "join AP" gesture (lv_qrcode widget).
CONFIG_LV_USE_QRCODE=y

# Web control plane
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
# Push 20 Hz state targets over a pool of three sockets; the browser interpolates at 60 FPS.
CONFIG_HTTPD_WS_SUPPORT=y
# Debug aid: lets /api/v1/debug/snapshot re-render the live screen so the
# physical face can be captured off-device (tools/fetch_panel_snapshot.py).
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
